; ModuleID = 'split_redirect_lh_ipv4_tc.c'
source_filename = "split_redirect_lh_ipv4_tc.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.anon = type { ptr, ptr, ptr, ptr }
%struct.anon.0 = type { ptr, ptr, ptr, ptr }
%struct.__sk_buff = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [5 x i32], i32, i32, i32, i32, i32, i32, i32, i32, [4 x i32], [4 x i32], i32, i32, i32, %union.anon, i64, i32, i32, %union.anon.1, i32, i8, [3 x i8], i64 }
%union.anon = type { ptr }
%union.anon.1 = type { ptr }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.lh_route = type { i32, i32, i32, i32, [6 x i8], [6 x i8] }

@_license = dso_local global [4 x i8] c"GPL\00", section "license", align 1, !dbg !0
@tc_lh_map = dso_local global %struct.anon zeroinitializer, section ".maps", align 8, !dbg !13
@tc_lhaddr_map = dso_local global %struct.anon.0 zeroinitializer, section ".maps", align 8, !dbg !44
@llvm.compiler.used = appending global [4 x ptr] [ptr @_license, ptr @tc_lh2split, ptr @tc_lh_map, ptr @tc_lhaddr_map], section "llvm.metadata"

; Function Attrs: nounwind
define dso_local noundef i32 @tc_lh2split(ptr noundef %0) #0 section "tc" !dbg !175 {
  %2 = alloca i32, align 4, !DIAssignID !181
  %3 = alloca i32, align 4, !DIAssignID !182
  %4 = alloca i32, align 4, !DIAssignID !183
  %5 = alloca i32, align 4, !DIAssignID !184
  %6 = alloca i32, align 4, !DIAssignID !185
  %7 = alloca i32, align 4, !DIAssignID !186

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 244, type: !167, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "Ubuntu clang version 18.1.3 (1ubuntu1)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !12, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "split_redirect_lh_ipv4_tc.c", directory: "/home/togoetha/projects/service/xdp-progs/multi-runtime-cni-ipv4", checksumkind: CSK_MD5, checksum: "5d1956f1db2028d48e48f30ce2098439")
!4 = !{!5, !6, !7, !10}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!6 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !8, line: 27, baseType: !9)
!8 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!9 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !8, line: 24, baseType: !11)
!11 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!12 = !{!0, !13, !44, !52, !60}
!13 = !DIGlobalVariableExpression(var: !14, expr: !DIExpression())
!14 = distinct !DIGlobalVariable(name: "tc_lh_map", scope: !2, file: !3, line: 40, type: !15, isLocal: false, isDefinition: true)
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 35, size: 256, elements: !16)
!16 = !{!17, !23, !28, !30}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !15, file: !3, line: 36, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 64, elements: !21)
!20 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!21 = !{!22}
!22 = !DISubrange(count: 2)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !15, file: !3, line: 37, baseType: !24, size: 64, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 256, elements: !26)
!26 = !{!27}
!27 = !DISubrange(count: 8)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !15, file: !3, line: 38, baseType: !29, size: 64, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !15, file: !3, line: 39, baseType: !31, size: 64, offset: 192)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lh_route", file: !3, line: 26, size: 224, elements: !33)
!33 = !{!34, !35, !36, !37, !38, !43}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !32, file: !3, line: 27, baseType: !7, size: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "targetifindex", scope: !32, file: !3, line: 28, baseType: !7, size: 32, offset: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_saddr", scope: !32, file: !3, line: 29, baseType: !7, size: 32, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_daddr", scope: !32, file: !3, line: 30, baseType: !7, size: 32, offset: 96)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "smac", scope: !32, file: !3, line: 31, baseType: !39, size: 48, offset: 128)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 48, elements: !41)
!40 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!41 = !{!42}
!42 = !DISubrange(count: 6)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "dmac", scope: !32, file: !3, line: 32, baseType: !39, size: 48, offset: 176)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "tc_lhaddr_map", scope: !2, file: !3, line: 47, type: !46, isLocal: false, isDefinition: true)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 42, size: 256, elements: !47)
!47 = !{!48, !49, !50, !51}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !46, file: !3, line: 43, baseType: !18, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !46, file: !3, line: 44, baseType: !24, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !46, file: !3, line: 45, baseType: !29, size: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !46, file: !3, line: 46, baseType: !29, size: 64, offset: 192)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!53 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !54, line: 56, type: !55, isLocal: true, isDefinition: true)
!54 = !DIFile(filename: "/usr/include/bpf/bpf_helper_defs.h", directory: "", checksumkind: CSK_MD5, checksum: "09cfcd7169c24bec448f30582e8c6db9")
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{!5, !5, !58}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression(DW_OP_constu, 13, DW_OP_stack_value))
!61 = distinct !DIGlobalVariable(name: "bpf_clone_redirect", scope: !2, file: !54, line: 357, type: !62, isLocal: true, isDefinition: true)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{!6, !65, !7, !138}
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sk_buff", file: !67, line: 6111, size: 1536, elements: !68)
!67 = !DIFile(filename: "/usr/include/linux/bpf.h", directory: "", checksumkind: CSK_MD5, checksum: "8106ce79fb72e4cfc709095592a01f1d")
!68 = !{!69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !85, !86, !87, !88, !89, !90, !91, !92, !93, !97, !98, !99, !100, !101, !137, !140, !141, !142, !164, !165, !166}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !66, file: !67, line: 6112, baseType: !7, size: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !66, file: !67, line: 6113, baseType: !7, size: 32, offset: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !66, file: !67, line: 6114, baseType: !7, size: 32, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !66, file: !67, line: 6115, baseType: !7, size: 32, offset: 96)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !66, file: !67, line: 6116, baseType: !7, size: 32, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_present", scope: !66, file: !67, line: 6117, baseType: !7, size: 32, offset: 160)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !66, file: !67, line: 6118, baseType: !7, size: 32, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !66, file: !67, line: 6119, baseType: !7, size: 32, offset: 224)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !66, file: !67, line: 6120, baseType: !7, size: 32, offset: 256)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !66, file: !67, line: 6121, baseType: !7, size: 32, offset: 288)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !66, file: !67, line: 6122, baseType: !7, size: 32, offset: 320)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "tc_index", scope: !66, file: !67, line: 6123, baseType: !7, size: 32, offset: 352)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !66, file: !67, line: 6124, baseType: !82, size: 160, offset: 384)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 160, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 5)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !66, file: !67, line: 6125, baseType: !7, size: 32, offset: 544)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "tc_classid", scope: !66, file: !67, line: 6126, baseType: !7, size: 32, offset: 576)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !66, file: !67, line: 6127, baseType: !7, size: 32, offset: 608)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !66, file: !67, line: 6128, baseType: !7, size: 32, offset: 640)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !66, file: !67, line: 6129, baseType: !7, size: 32, offset: 672)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !66, file: !67, line: 6132, baseType: !7, size: 32, offset: 704)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip4", scope: !66, file: !67, line: 6133, baseType: !7, size: 32, offset: 736)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip4", scope: !66, file: !67, line: 6134, baseType: !7, size: 32, offset: 768)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip6", scope: !66, file: !67, line: 6135, baseType: !94, size: 128, offset: 800)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 4)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip6", scope: !66, file: !67, line: 6136, baseType: !94, size: 128, offset: 928)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "remote_port", scope: !66, file: !67, line: 6137, baseType: !7, size: 32, offset: 1056)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "local_port", scope: !66, file: !67, line: 6138, baseType: !7, size: 32, offset: 1088)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !66, file: !67, line: 6141, baseType: !7, size: 32, offset: 1120)
!101 = !DIDerivedType(tag: DW_TAG_member, scope: !66, file: !67, line: 6142, baseType: !102, size: 64, align: 64, offset: 1152)
!102 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !66, file: !67, line: 6142, size: 64, align: 64, elements: !103)
!103 = !{!104}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "flow_keys", scope: !102, file: !67, line: 6142, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_flow_keys", file: !67, line: 7128, size: 448, elements: !107)
!107 = !{!108, !109, !110, !111, !113, !114, !115, !116, !119, !120, !121, !135, !136}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "nhoff", scope: !106, file: !67, line: 7129, baseType: !10, size: 16)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "thoff", scope: !106, file: !67, line: 7130, baseType: !10, size: 16, offset: 16)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "addr_proto", scope: !106, file: !67, line: 7131, baseType: !10, size: 16, offset: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "is_frag", scope: !106, file: !67, line: 7132, baseType: !112, size: 8, offset: 48)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !8, line: 21, baseType: !40)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "is_first_frag", scope: !106, file: !67, line: 7133, baseType: !112, size: 8, offset: 56)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "is_encap", scope: !106, file: !67, line: 7134, baseType: !112, size: 8, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "ip_proto", scope: !106, file: !67, line: 7135, baseType: !112, size: 8, offset: 72)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "n_proto", scope: !106, file: !67, line: 7136, baseType: !117, size: 16, offset: 80)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !118, line: 32, baseType: !10)
!118 = !DIFile(filename: "/usr/include/linux/types.h", directory: "", checksumkind: CSK_MD5, checksum: "bf9fbc0e8f60927fef9d8917535375a6")
!119 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !106, file: !67, line: 7137, baseType: !117, size: 16, offset: 96)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !106, file: !67, line: 7138, baseType: !117, size: 16, offset: 112)
!121 = !DIDerivedType(tag: DW_TAG_member, scope: !106, file: !67, line: 7139, baseType: !122, size: 256, offset: 128)
!122 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !106, file: !67, line: 7139, size: 256, elements: !123)
!123 = !{!124, !130}
!124 = !DIDerivedType(tag: DW_TAG_member, scope: !122, file: !67, line: 7140, baseType: !125, size: 64)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !122, file: !67, line: 7140, size: 64, elements: !126)
!126 = !{!127, !129}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_src", scope: !125, file: !67, line: 7141, baseType: !128, size: 32)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !118, line: 34, baseType: !7)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_dst", scope: !125, file: !67, line: 7142, baseType: !128, size: 32, offset: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, scope: !122, file: !67, line: 7144, baseType: !131, size: 256)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !122, file: !67, line: 7144, size: 256, elements: !132)
!132 = !{!133, !134}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_src", scope: !131, file: !67, line: 7145, baseType: !94, size: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_dst", scope: !131, file: !67, line: 7146, baseType: !94, size: 128, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !106, file: !67, line: 7149, baseType: !7, size: 32, offset: 384)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "flow_label", scope: !106, file: !67, line: 7150, baseType: !128, size: 32, offset: 416)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !66, file: !67, line: 6143, baseType: !138, size: 64, offset: 1216)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !8, line: 31, baseType: !139)
!139 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "wire_len", scope: !66, file: !67, line: 6144, baseType: !7, size: 32, offset: 1280)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "gso_segs", scope: !66, file: !67, line: 6145, baseType: !7, size: 32, offset: 1312)
!142 = !DIDerivedType(tag: DW_TAG_member, scope: !66, file: !67, line: 6146, baseType: !143, size: 64, align: 64, offset: 1344)
!143 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !66, file: !67, line: 6146, size: 64, align: 64, elements: !144)
!144 = !{!145}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !143, file: !67, line: 6146, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_sock", file: !67, line: 6215, size: 640, elements: !148)
!148 = !{!149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "bound_dev_if", scope: !147, file: !67, line: 6216, baseType: !7, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !147, file: !67, line: 6217, baseType: !7, size: 32, offset: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !147, file: !67, line: 6218, baseType: !7, size: 32, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !147, file: !67, line: 6219, baseType: !7, size: 32, offset: 96)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !147, file: !67, line: 6220, baseType: !7, size: 32, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !147, file: !67, line: 6221, baseType: !7, size: 32, offset: 160)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip4", scope: !147, file: !67, line: 6223, baseType: !7, size: 32, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip6", scope: !147, file: !67, line: 6224, baseType: !94, size: 128, offset: 224)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "src_port", scope: !147, file: !67, line: 6225, baseType: !7, size: 32, offset: 352)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "dst_port", scope: !147, file: !67, line: 6226, baseType: !117, size: 16, offset: 384)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip4", scope: !147, file: !67, line: 6228, baseType: !7, size: 32, offset: 416)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip6", scope: !147, file: !67, line: 6229, baseType: !94, size: 128, offset: 448)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !147, file: !67, line: 6230, baseType: !7, size: 32, offset: 576)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_mapping", scope: !147, file: !67, line: 6231, baseType: !163, size: 32, offset: 608)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !8, line: 26, baseType: !20)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "gso_size", scope: !66, file: !67, line: 6147, baseType: !7, size: 32, offset: 1408)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp_type", scope: !66, file: !67, line: 6148, baseType: !112, size: 8, offset: 1440)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "hwtstamp", scope: !66, file: !67, line: 6150, baseType: !138, size: 64, offset: 1472)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 32, elements: !95)
!168 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!169 = !{i32 7, !"Dwarf Version", i32 5}
!170 = !{i32 2, !"Debug Info Version", i32 3}
!171 = !{i32 1, !"wchar_size", i32 4}
!172 = !{i32 7, !"frame-pointer", i32 2}
!173 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!174 = !{!"Ubuntu clang version 18.1.3 (1ubuntu1)"}
!175 = distinct !DISubprogram(name: "tc_lh2split", scope: !3, file: !3, line: 233, type: !176, scopeLine: 233, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !178)
!176 = !DISubroutineType(types: !177)
!177 = !{!20, !65}
!178 = !{!179, !180}
!179 = !DILocalVariable(name: "skb", arg: 1, scope: !175, file: !3, line: 233, type: !65)
!180 = !DILocalVariable(name: "handled", scope: !175, file: !3, line: 236, type: !20)
!181 = distinct !DIAssignID()
!182 = distinct !DIAssignID()
!183 = distinct !DIAssignID()
!184 = distinct !DIAssignID()
!185 = distinct !DIAssignID()
!186 = distinct !DIAssignID()
!187 = distinct !DIAssignID()
!188 = distinct !DIAssignID()
!189 = distinct !DIAssignID()
!190 = distinct !DIAssignID()
!191 = distinct !DIAssignID()
!192 = distinct !DIAssignID()
!193 = !DILocation(line: 0, scope: !175)
!194 = !DILocalVariable(name: "skb", arg: 1, scope: !195, file: !3, line: 161, type: !65)
!195 = distinct !DISubprogram(name: "ipv4_lh_handle", scope: !3, file: !3, line: 161, type: !176, scopeLine: 161, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !196)
!196 = !{!194, !197, !198, !199, !207, !235, !236, !237}
!197 = !DILocalVariable(name: "data_end", scope: !195, file: !3, line: 162, type: !5)
!198 = !DILocalVariable(name: "data", scope: !195, file: !3, line: 163, type: !5)
!199 = !DILocalVariable(name: "ethh", scope: !195, file: !3, line: 166, type: !200)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !202, line: 173, size: 112, elements: !203)
!202 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "", checksumkind: CSK_MD5, checksum: "163f54fb1af2e21fea410f14eb18fa76")
!203 = !{!204, !205, !206}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !201, file: !202, line: 174, baseType: !39, size: 48)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !201, file: !202, line: 175, baseType: !39, size: 48, offset: 48)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !201, file: !202, line: 176, baseType: !117, size: 16, offset: 96)
!207 = !DILocalVariable(name: "ip4h", scope: !195, file: !3, line: 172, type: !208)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !210, line: 87, size: 160, elements: !211)
!210 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "", checksumkind: CSK_MD5, checksum: "149778ace30a1ff208adc8783fd04b29")
!211 = !{!212, !213, !214, !215, !216, !217, !218, !219, !220, !222}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !209, file: !210, line: 89, baseType: !112, size: 4, flags: DIFlagBitField, extraData: i64 0)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !209, file: !210, line: 90, baseType: !112, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !209, file: !210, line: 97, baseType: !112, size: 8, offset: 8)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !209, file: !210, line: 98, baseType: !117, size: 16, offset: 16)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !209, file: !210, line: 99, baseType: !117, size: 16, offset: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !209, file: !210, line: 100, baseType: !117, size: 16, offset: 48)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !209, file: !210, line: 101, baseType: !112, size: 8, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !209, file: !210, line: 102, baseType: !112, size: 8, offset: 72)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !209, file: !210, line: 103, baseType: !221, size: 16, offset: 80)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !118, line: 38, baseType: !10)
!222 = !DIDerivedType(tag: DW_TAG_member, scope: !209, file: !210, line: 104, baseType: !223, size: 64, offset: 96)
!223 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !209, file: !210, line: 104, size: 64, elements: !224)
!224 = !{!225, !230}
!225 = !DIDerivedType(tag: DW_TAG_member, scope: !223, file: !210, line: 104, baseType: !226, size: 64)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !223, file: !210, line: 104, size: 64, elements: !227)
!227 = !{!228, !229}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !226, file: !210, line: 104, baseType: !128, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !226, file: !210, line: 104, baseType: !128, size: 32, offset: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !223, file: !210, line: 104, baseType: !231, size: 64)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !223, file: !210, line: 104, size: 64, elements: !232)
!232 = !{!233, !234}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !231, file: !210, line: 104, baseType: !128, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !231, file: !210, line: 104, baseType: !128, size: 32, offset: 32)
!235 = !DILocalVariable(name: "ip_dst_addr", scope: !195, file: !3, line: 186, type: !7)
!236 = !DILocalVariable(name: "lhaddr", scope: !195, file: !3, line: 188, type: !7)
!237 = !DILocalVariable(name: "snet", scope: !195, file: !3, line: 189, type: !7)
!238 = !DILocation(line: 0, scope: !195, inlinedAt: !239)
!239 = distinct !DILocation(line: 236, column: 16, scope: !175)
!240 = !DILocation(line: 162, column: 38, scope: !195, inlinedAt: !239)
!241 = !{!242, !243, i64 80}
!242 = !{!"__sk_buff", !243, i64 0, !243, i64 4, !243, i64 8, !243, i64 12, !243, i64 16, !243, i64 20, !243, i64 24, !243, i64 28, !243, i64 32, !243, i64 36, !243, i64 40, !243, i64 44, !244, i64 48, !243, i64 68, !243, i64 72, !243, i64 76, !243, i64 80, !243, i64 84, !243, i64 88, !243, i64 92, !243, i64 96, !244, i64 100, !244, i64 116, !243, i64 132, !243, i64 136, !243, i64 140, !244, i64 144, !246, i64 152, !243, i64 160, !243, i64 164, !244, i64 168, !243, i64 176, !244, i64 180, !246, i64 184}
!243 = !{!"int", !244, i64 0}
!244 = !{!"omnipotent char", !245, i64 0}
!245 = !{!"Simple C/C++ TBAA"}
!246 = !{!"long long", !244, i64 0}
!247 = !DILocation(line: 162, column: 27, scope: !195, inlinedAt: !239)
!248 = !DILocation(line: 162, column: 19, scope: !195, inlinedAt: !239)
!249 = !DILocation(line: 163, column: 34, scope: !195, inlinedAt: !239)
!250 = !{!242, !243, i64 76}
!251 = !DILocation(line: 163, column: 23, scope: !195, inlinedAt: !239)
!252 = !DILocation(line: 163, column: 15, scope: !195, inlinedAt: !239)
!253 = !DILocation(line: 167, column: 20, scope: !254, inlinedAt: !239)
!254 = distinct !DILexicalBlock(scope: !195, file: !3, line: 167, column: 6)
!255 = !DILocation(line: 167, column: 25, scope: !254, inlinedAt: !239)
!256 = !DILocation(line: 167, column: 6, scope: !195, inlinedAt: !239)
!257 = !DILocation(line: 180, column: 12, scope: !258, inlinedAt: !239)
!258 = distinct !DILexicalBlock(scope: !195, file: !3, line: 180, column: 6)
!259 = !DILocation(line: 180, column: 20, scope: !258, inlinedAt: !239)
!260 = !DILocation(line: 180, column: 6, scope: !195, inlinedAt: !239)
!261 = !DILocation(line: 186, column: 28, scope: !195, inlinedAt: !239)
!262 = !{!244, !244, i64 0}
!263 = !DILocation(line: 188, column: 23, scope: !195, inlinedAt: !239)
!264 = !DILocation(line: 188, column: 29, scope: !195, inlinedAt: !239)
!265 = !DILocation(line: 204, column: 18, scope: !266, inlinedAt: !239)
!266 = distinct !DILexicalBlock(scope: !195, file: !3, line: 204, column: 6)
!267 = !DILocation(line: 204, column: 6, scope: !195, inlinedAt: !239)
!268 = !DILocalVariable(name: "i", arg: 1, scope: !269, file: !3, line: 85, type: !7)
!269 = distinct !DISubprogram(name: "clone_redir_forward", scope: !3, file: !3, line: 85, type: !270, scopeLine: 85, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !272)
!270 = !DISubroutineType(types: !271)
!271 = !{!20, !7, !65}
!272 = !{!268, !273, !274, !275, !278, !279, !280}
!273 = !DILocalVariable(name: "skb", arg: 2, scope: !269, file: !3, line: 85, type: !65)
!274 = !DILocalVariable(name: "lhinfo", scope: !269, file: !3, line: 87, type: !31)
!275 = !DILocalVariable(name: "data_end", scope: !276, file: !3, line: 99, type: !5)
!276 = distinct !DILexicalBlock(scope: !277, file: !3, line: 95, column: 37)
!277 = distinct !DILexicalBlock(scope: !269, file: !3, line: 95, column: 6)
!278 = !DILocalVariable(name: "data", scope: !276, file: !3, line: 100, type: !5)
!279 = !DILocalVariable(name: "ethh", scope: !276, file: !3, line: 103, type: !200)
!280 = !DILocalVariable(name: "iph", scope: !281, file: !3, line: 106, type: !208)
!281 = distinct !DILexicalBlock(scope: !282, file: !3, line: 104, column: 39)
!282 = distinct !DILexicalBlock(scope: !276, file: !3, line: 104, column: 7)
