; ModuleID = 'translate_redirect_lh_ipv4_xdp.c'
source_filename = "translate_redirect_lh_ipv4_xdp.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.anon = type { ptr, ptr, ptr, ptr }
%struct.xdp_md = type { i32, i32, i32, i32, i32, i32 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }

@xdp_lhredirect.____fmt = internal constant [7 x i8] c"start\0A\00", align 1, !dbg !0
@_license = dso_local global [4 x i8] c"GPL\00", section "license", align 1, !dbg !35
@xdp_redirect_map = dso_local global %struct.anon zeroinitializer, section ".maps", align 8, !dbg !41
@ipv4_redirect_handle.____fmt = internal constant [12 x i8] c"ipv4 check\0A\00", align 1, !dbg !70
@ipv4_redirect_handle.____fmt.1 = internal constant [9 x i8] c"no ipv4\0A\00", align 1, !dbg !129
@ipv4_redirect_handle.____fmt.2 = internal constant [17 x i8] c"localhost check\0A\00", align 1, !dbg !132
@ipv4_redirect_handle.____fmt.3 = internal constant [25 x i8] c"no localhost route found\00", align 1, !dbg !137
@ipv4_redirect_handle.____fmt.4 = internal constant [8 x i8] c"lh info\00", align 1, !dbg !142
@ipv4_redirect_handle.____fmt.5 = internal constant [13 x i8] c"ip check %x\0A\00", align 1, !dbg !147
@ipv4_check.____fmt = internal constant [10 x i8] c"csum %08x\00", align 1, !dbg !159
@llvm.compiler.used = appending global [3 x ptr] [ptr @_license, ptr @xdp_lhredirect, ptr @xdp_redirect_map], section "llvm.metadata"

; Function Attrs: nounwind

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 129, type: !182, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "xdp_lhredirect", scope: !3, file: !3, line: 125, type: !4, scopeLine: 125, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !177)
!3 = !DIFile(filename: "translate_redirect_lh_ipv4_xdp.c", directory: "/home/togoetha/projects/service/xdp-progs/multi-runtime-cni-ipv4", checksumkind: CSK_MD5, checksum: "191da4ed2edd519b01f937ec4b8bac69")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !7}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !9, line: 6331, size: 192, elements: !10)
!9 = !DIFile(filename: "/usr/include/linux/bpf.h", directory: "", checksumkind: CSK_MD5, checksum: "8106ce79fb72e4cfc709095592a01f1d")
!10 = !{!11, !15, !16, !17, !18, !19}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !8, file: !9, line: 6332, baseType: !12, size: 32)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !13, line: 27, baseType: !14)
!13 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !8, file: !9, line: 6333, baseType: !12, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !8, file: !9, line: 6334, baseType: !12, size: 32, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !8, file: !9, line: 6336, baseType: !12, size: 32, offset: 96)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !8, file: !9, line: 6337, baseType: !12, size: 32, offset: 128)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "egress_ifindex", scope: !8, file: !9, line: 6339, baseType: !12, size: 32, offset: 160)
!20 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "Ubuntu clang version 18.1.3 (1ubuntu1)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !21, retainedTypes: !29, globals: !34, splitDebugInlining: false, nameTableKind: None)
!21 = !{!22}
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !9, line: 6320, baseType: !14, size: 32, elements: !23)
!23 = !{!24, !25, !26, !27, !28}
!24 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!25 = !DIEnumerator(name: "XDP_DROP", value: 1)
!26 = !DIEnumerator(name: "XDP_PASS", value: 2)
!27 = !DIEnumerator(name: "XDP_TX", value: 3)
!28 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!29 = !{!30, !31, !12, !32}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!31 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !13, line: 24, baseType: !33)
!33 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!34 = !{!0, !35, !41, !62, !70, !129, !132, !137, !142, !147, !152, !159}
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "_license", scope: !20, file: !3, line: 155, type: !37, isLocal: false, isDefinition: true)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 32, elements: !39)
!38 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!39 = !{!40}
!40 = !DISubrange(count: 4)
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(name: "xdp_redirect_map", scope: !20, file: !3, line: 29, type: !43, isLocal: false, isDefinition: true)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 24, size: 256, elements: !44)
!44 = !{!45, !50, !55, !57}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !43, file: !3, line: 25, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 288, elements: !48)
!48 = !{!49}
!49 = !DISubrange(count: 9)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !43, file: !3, line: 26, baseType: !51, size: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 64, elements: !53)
!53 = !{!54}
!54 = !DISubrange(count: 2)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !43, file: !3, line: 27, baseType: !56, size: 64, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !43, file: !3, line: 28, baseType: !58, size: 64, offset: 192)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lh_info", file: !3, line: 16, size: 32, elements: !60)
!60 = !{!61}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_saddr", scope: !59, file: !3, line: 18, baseType: !12, size: 32)
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression(DW_OP_constu, 6, DW_OP_stack_value))
!63 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !20, file: !64, line: 177, type: !65, isLocal: true, isDefinition: true)
!64 = !DIFile(filename: "/usr/include/bpf/bpf_helper_defs.h", directory: "", checksumkind: CSK_MD5, checksum: "09cfcd7169c24bec448f30582e8c6db9")
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{!31, !68, !12, null}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!70 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!71 = distinct !DIGlobalVariable(name: "____fmt", scope: !72, file: !3, line: 77, type: !126, isLocal: true, isDefinition: true)
!72 = distinct !DISubprogram(name: "ipv4_redirect_handle", scope: !3, file: !3, line: 67, type: !73, scopeLine: 67, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !88)
!73 = !DISubroutineType(types: !74)
!74 = !{!6, !7, !75}
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !77, line: 173, size: 112, elements: !78)
!77 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "", checksumkind: CSK_MD5, checksum: "163f54fb1af2e21fea410f14eb18fa76")
!78 = !{!79, !84, !85}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !76, file: !77, line: 174, baseType: !80, size: 48)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 48, elements: !82)
!81 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!82 = !{!83}
!83 = !DISubrange(count: 6)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !76, file: !77, line: 175, baseType: !80, size: 48, offset: 48)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !76, file: !77, line: 176, baseType: !86, size: 16, offset: 96)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !87, line: 32, baseType: !32)
!87 = !DIFile(filename: "/usr/include/linux/types.h", directory: "", checksumkind: CSK_MD5, checksum: "bf9fbc0e8f60927fef9d8917535375a6")
!88 = !{!89, !90, !91, !92, !122, !123, !124, !125}
!89 = !DILocalVariable(name: "ctx", arg: 1, scope: !72, file: !3, line: 67, type: !7)
!90 = !DILocalVariable(name: "ethh", arg: 2, scope: !72, file: !3, line: 67, type: !75)
!91 = !DILocalVariable(name: "data_end", scope: !72, file: !3, line: 68, type: !30)
!92 = !DILocalVariable(name: "iph", scope: !72, file: !3, line: 70, type: !93)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !95, line: 87, size: 160, elements: !96)
!95 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "", checksumkind: CSK_MD5, checksum: "149778ace30a1ff208adc8783fd04b29")
!96 = !{!97, !99, !100, !101, !102, !103, !104, !105, !106, !108}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !94, file: !95, line: 89, baseType: !98, size: 4, flags: DIFlagBitField, extraData: i64 0)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !13, line: 21, baseType: !81)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !94, file: !95, line: 90, baseType: !98, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !94, file: !95, line: 97, baseType: !98, size: 8, offset: 8)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !94, file: !95, line: 98, baseType: !86, size: 16, offset: 16)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !94, file: !95, line: 99, baseType: !86, size: 16, offset: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !94, file: !95, line: 100, baseType: !86, size: 16, offset: 48)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !94, file: !95, line: 101, baseType: !98, size: 8, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !94, file: !95, line: 102, baseType: !98, size: 8, offset: 72)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !94, file: !95, line: 103, baseType: !107, size: 16, offset: 80)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !87, line: 38, baseType: !32)
!108 = !DIDerivedType(tag: DW_TAG_member, scope: !94, file: !95, line: 104, baseType: !109, size: 64, offset: 96)
!109 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !94, file: !95, line: 104, size: 64, elements: !110)
!110 = !{!111, !117}
!111 = !DIDerivedType(tag: DW_TAG_member, scope: !109, file: !95, line: 104, baseType: !112, size: 64)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !109, file: !95, line: 104, size: 64, elements: !113)
!113 = !{!114, !116}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !112, file: !95, line: 104, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !87, line: 34, baseType: !12)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !112, file: !95, line: 104, baseType: !115, size: 32, offset: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !109, file: !95, line: 104, baseType: !118, size: 64)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !109, file: !95, line: 104, size: 64, elements: !119)
!119 = !{!120, !121}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !118, file: !95, line: 104, baseType: !115, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !118, file: !95, line: 104, baseType: !115, size: 32, offset: 32)
!122 = !DILocalVariable(name: "ip_dst_addr", scope: !72, file: !3, line: 84, type: !12)
!123 = !DILocalVariable(name: "ip_src_addr", scope: !72, file: !3, line: 85, type: !12)
!124 = !DILocalVariable(name: "lhinfo", scope: !72, file: !3, line: 99, type: !58)
!125 = !DILocalVariable(name: "idx", scope: !72, file: !3, line: 101, type: !12)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 96, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 12)
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(name: "____fmt", scope: !72, file: !3, line: 79, type: !131, isLocal: true, isDefinition: true)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 72, elements: !48)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(name: "____fmt", scope: !72, file: !3, line: 83, type: !134, isLocal: true, isDefinition: true)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 136, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 17)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "____fmt", scope: !72, file: !3, line: 106, type: !139, isLocal: true, isDefinition: true)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 200, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 25)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "____fmt", scope: !72, file: !3, line: 110, type: !144, isLocal: true, isDefinition: true)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 64, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 8)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(name: "____fmt", scope: !72, file: !3, line: 119, type: !149, isLocal: true, isDefinition: true)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 104, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 13)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!153 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !20, file: !64, line: 56, type: !154, isLocal: true, isDefinition: true)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!30, !30, !157}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(name: "____fmt", scope: !161, file: !3, line: 61, type: !174, isLocal: true, isDefinition: true)
!161 = distinct !DISubprogram(name: "ipv4_check", scope: !3, file: !3, line: 32, type: !162, scopeLine: 32, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !165)
!162 = !DISubroutineType(types: !163)
!163 = !{!32, !164, !32, !30}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!165 = !{!166, !167, !168, !169, !170, !172, !173}
!166 = !DILocalVariable(name: "packet", arg: 1, scope: !161, file: !3, line: 32, type: !164)
!167 = !DILocalVariable(name: "len", arg: 2, scope: !161, file: !3, line: 32, type: !32)
!168 = !DILocalVariable(name: "data_end", arg: 3, scope: !161, file: !3, line: 32, type: !30)
!169 = !DILocalVariable(name: "csum", scope: !161, file: !3, line: 33, type: !12)
!170 = !DILocalVariable(name: "i", scope: !171, file: !3, line: 40, type: !6)
!171 = distinct !DILexicalBlock(scope: !161, file: !3, line: 40, column: 5)
!172 = !DILocalVariable(name: "i", scope: !161, file: !3, line: 55, type: !6)
